const String EULA =
    """
    
    用户协议

欢迎使用紫藤法道！在使用本应用之前，请仔细阅读以下用户协议。本协议是您与紫藤法道之间的法律协议，规定了您使用紫藤法道提供的服务的权利和义务。使用紫藤法道，即表示您同意遵守本协议的所有条款和条件。如果您不同意本协议的任何条款，请停止使用紫藤法道。

1. 服务内容
紫藤法道是一款基于人工智能技术的法律咨询平台，旨在为用户提供法律咨询和相关信息。紫藤法道通过使用先进的自然语言处理和机器学习算法，为用户提供准确、及时的法律咨询服务。但请注意，紫藤法道提供的信息仅供参考，不构成法律意见或建议。

2. 用户责任
2.1 您在使用紫藤法道时应遵守法律法规和社会道德规范，不得利用紫藤法道从事任何违法、侵权或有害的活动。
2.2 您应妥善保管您的账户和密码，并对您的账户下的所有行为负责。如发现任何未经授权使用您账户的情况，应立即通知紫藤法道。
2.3 您不得以任何方式干扰或破坏紫藤法道的正常运行，包括但不限于使用恶意软件、病毒、网络攻击等行为。

3. 隐私保护
3.1 紫藤法道非常重视用户的隐私保护。在使用紫藤法道的过程中，您的个人信息可能会被收集和使用。紫藤法道将按照相关法律法规和隐私政策的要求，对您的个人信息进行保护和处理。
3.2 紫藤法道将采取合理的安全措施，保护您的个人信息的安全性。但请注意，互联网并非绝对安全的环境，您在使用紫藤法道时应自行承担一定的风险。

4. 知识产权
4.1 紫藤法道的所有知识产权（包括但不限于软件、算法、界面设计、图标、标识等）均归紫藤法道所有。
4.2 未经紫藤法道的书面许可，您不得以任何方式复制、修改、传播、展示或使用紫藤法道的知识产权。

5. 免责声明
5.1 紫藤法道提供的服务和信息仅供参考，不构成法律意见或建议。您应自行判断和承担使用紫藤法道所提供信息的风险和责任。
5.2 紫藤法道无法保证其提供的服务和信息的准确性、完整性、及时性和可靠性。对于由于使用紫藤法道而导致的任何直接或间接损失或损害，紫藤法道不承担任何责任。
5.3 紫藤法道不对因不可抗力、计算机病毒、黑客攻击、系统故障、网络中断等原因而导致的服务中断、错误、延迟、信息丢失等问题承担责任。

6. 终止协议
6.1 您可以随时终止本协议，停止使用紫藤法道。
6.2 紫藤法道有权在发现您违反本协议的情况下，立即终止本协议，并可能采取相应的法律措施。

7. 其他条款
7.1 本协议的解释、生效、执行和争议解决均适用中华人民共和国的法律。
7.2 如本协议的任何条款被认定为无效或不可执行，不影响其他条款的效力。
7.3 紫藤法道对本协议拥有最终解释权。

请您在使用紫藤法道之前仔细阅读并理解本用户协议的所有条款。如果您对协议内容有任何疑问，请联系紫藤法道的开发团队进行咨询。一旦您开始使用紫藤法道，即表示您已阅读、理解并同意遵守本用户协议的所有条款和条件。
    """;